---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayDepthCueing.EnableDepthCueing
source: html/4acfa60c-73f0-bc89-8f3e-f45a62d688d3.htm
---
# Autodesk.Revit.DB.ViewDisplayDepthCueing.EnableDepthCueing Property

True to enable depth cueing. False to disable it.

## Syntax (C#)
```csharp
public bool EnableDepthCueing { get; set; }
```